﻿/* Notification that a user reacted to a post that the current user was tagged in */
"reacted_tagged_in_1" = " %@ đã thể hiện cảm xúc trên bài đăng mà bạn được gắn thẻ";

/* Notification that 2 users reacted to a post that the current user was tagged in */
"reacted_tagged_in_2" = "%@ và %@ đã thể hiện cảm xúc trên bài đăng mà bạn được gắn thẻ";

/* Notification that a user reposted a post that the current user was tagged in */
"reposted_tagged_in_1" = "%@ đã đăng lại bài đăng mà bạn được gắn thẻ";

/* Notification that 2 users reposted a post that the current user was tagged in */
"reposted_tagged_in_2" = "%@ và %@ đã đăng lại bài đăng mà bạn được gắn thẻ";

/* Notification that a user zapped a post that the current user was tagged in */
"zapped_tagged_in_1" = "%@ đã zap bài đăng mà bạn được gắn thẻ";

/* Notification that 2 users zapped a post that the current user was tagged in */
"zapped_tagged_in_2" = "%@ và %@ đã zap bài đăng mà bạn được gắn thẻ";

/* Notification that a user reacted to the current user's post */
"reacted_your_post_1" = "%@ đã thể hiện cảm xúc trên bài đăng của bạn";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_post_2" = "%@ và %@ thể hiện cảm xúc trên bài đăng của bạn";

/* Notification that a user reposted the current user's post */
"reposted_your_post_1" = "%@ đăng lại bài đăng của bạn";

/* Notification that 2 users reposted the current user's post */
"reposted_your_post_2" = "%@ và %@ đăng lại bài đăng của bạn";

/* Notification that a user zapped the current user's post */
"zapped_your_post_1" = "%@ đã zap bài đăng của bạn";

/* Notification that 2 users zapped the current user's post */
"zapped_your_post_2" = "%@ và %@ đã zap bài đăng của bạn";

/* Notification that a user reacted to the current user's profile */
"reacted_your_profile_1" = "%@ thể hiện cảm xúc trên hồ sơ của bạn";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_profile_2" = "%@ và %@ thể hiện cảm xúc trên hồ sơ của bạn";

/* Notification that a user reposted the current user's profile */
"reposted_your_profile_1" = "%@ đăng lại hồ sơ của bạn";

/* Notification that 2 users reposted the current user's profile */
"reposted_your_profile_2" = "%@ và %@ đăng lại hồ sơ của bạn";

/* Notification that a user zapped the current user's profile */
"zapped_your_profile_1" = "%@ đã zap hồ sơ của bạn";

/* Notification that 2 users zapped the current user's profile */
"zapped_your_profile_2" = "%@ và %@ đã zap hồ sơ của bạn";
/* No comment provided by engineer. */
"%@" = "%@";

/* Alert message that informs a user was blocked. */
"%@ has been blocked" = "%@ đã được chặn ";

/* When a note or profile is not found when searching for it via its note id */
"%@ not found" = "Không tìm thấy %@";

/* Explanation of what is done to keep personally identifiable information private. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Creating an account doesn't require a phone number, email or name. Get started right away with zero friction." = "%@. Tạo tài khoản không yêu cầu số điện thoại, email hoặc tên. Bắt đầu ngay mà không phải lo lắng gì.";

/* Explanation of what is done to keep private data encrypted. There is a heading that precedes this explanation which is a variable to this string. */
"%@. End-to-End encrypted private messaging. Keep Big Tech out of your DMs" = "%@. Tin nhắn cá nhân được mã hóa đầu cuối. Giữ \"những kẻ rình rập Big Tech\" ra khỏi tin nhắn cá nhân của bạn";

/* Explanation of what can be done by users to earn money. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Tip your friend's posts and stack sats with Bitcoin⚡️, the native currency of the internet." = "%@. Gửi tiền tip cho các bài đăng của bạn bè bạn và thu thập sats bằng Bitcoin⚡️, đơn vị tiền tệ bản địa của internet.";

/* Sentence composed of 2 variables to describe how many reactions there are on a post. In source English, the first variable is the number of reactions, and the second variable is 'Reaction' or 'Reactions'.
   Sentence composed of 2 variables to describe how many reposts. In source English, the first variable is the number of reposts, and the second variable is 'Repost' or 'Reposts'.
   Sentence composed of 2 variables to describe how many zap payments there are on a post. In source English, the first variable is the number of zap payments, and the second variable is 'Zap' or 'Zaps'. */
"%@.font(.body.bold())) %@" = "%1$@font(.body.bold())) %2$@";

/* Sentence composed of 2 variables to describe how many people are following a user. In source English, the first variable is the number of followers, and the second variable is 'Follower' or 'Followers'.
   Sentence composed of 2 variables to describe how many profiles a user is following. In source English, the first variable is the number of profiles being followed, and the second variable is 'Following'.
   Sentence composed of 2 variables to describe how many relay servers a user is connected. In source English, the first variable is the number of relay servers, and the second variable is 'Relay' or 'Relays'. */
"%@.font(.subheadline.weight(.medium))) %@" = "%1$@.font(.subheadline.weight(.medium))) %2$@";

/* Fraction of how many of the user's relay servers that are operational. */
"%@/%@" = "%1$@/%2$@";

/* Description of how the nip05 identifier would be used for verification. */
"'%@' at '%@' will be used for verification" = "'%1$@' tại '%2$@' sẽ được dùng cho xác minh";

/* Description of why the nip05 identifier is invalid. */
"'%@' is an invalid NIP-05 identifier. It should look like an email." = "'%@' là mã định danh NIP-05 không hợp lệ. Nó phải nên trông giống như một email.";

/* No comment provided by engineer. */
"@" = "@";

/* Label to prompt for about text entry for user to describe about themself. */
"About" = "Về";

/* Label for About Me section of user profile form. */
"About Me" = "Về tôi";

/* Placeholder text for About Me description. */
"Absolute Boss" = "Boss tuyệt vời";

/* Button to accept the end user license agreement before being allowed into the app. */
"Accept" = "Chấp nhận";

/* Label to indicate the public ID of the account. */
"Account ID" = "ID Tài khoản";

/* Title for confirmation dialog to either share, report, or block a profile. */
"Actions" = "Hành động";

/* Button to confirm adding user inputted relay. */
"Add" = "Thêm";

/* Button label to re-add all original participants as profiles to reply to in a note */
"Add all" = "Thêm tất cả";

/* Button text to add bookmark to a note.
   Context menu option for adding a note bookmark. */
"Add Bookmark" = "Thêm Dấu trang";

/* Button to add recommended relay server.
   Label for section for adding a relay server. */
"Add Relay" = "Thêm Relay";

/* Label to display relay contact user. */
"Admin" = "Admin";

/* Label for filter for all notifications. */
"All" = "Tất cả";

/* Setting to always show and never blur images */
"Always show images" = "Luôn luôn hiển thị hình ảnh";

/* Picker option to indicate that a zap should be sent anonymously and not identify the user as who sent it. */
"Anonymous" = "Ẩn danh";

/* Any amount of sats */
"Any" = "Bất kỳ";

/* Prompt for optional entry of API Key to use translation server. */
"API Key (optional)" = "Khóa API (tùy chọn)";

/* Prompt for required entry of API Key to use translation server. */
"API Key (required)" = "Khóa API (bắt buộc)";

/* Alert message to ask if user wants to repost a post. */
"Are you sure you want to repost this?" = "Bạn có chắc chắn muốn đăng lại không?";

/* Placeholder text for a comment to send as part of a zap to the user. */
"Awesome post!" = "Bài đăng tuyệt vời!";

/* Label for Banner Image section of user profile form. */
"Banner Image" = "Ảnh nền";

/* Reminder to user that they should save their account information. */
"Before we get started, you'll need to save your account info, otherwise you won't be able to login in the future if you ever uninstall Damus." = "Trước khi chúng ta bắt đầu, bạn sẽ cần lưu thông tin tài khoản của mình, nếu không, bạn sẽ không thể đăng nhập trong tương lai nếu bạn gỡ cài đặt Damus.";

/* Dropdown option label for Lightning wallet, Bitcoin Beach. */
"Bitcoin Beach" = "Bitcoin Beach";

/* Label for Bitcoin Lightning Tips section of user profile form. */
"Bitcoin Lightning Tips" = "Tiền Tips bằng Bitcoin Lightning";

/* Dropdown option label for Lightning wallet, Blixt Wallet */
"Blixt Wallet" = "Blixt Wallet";

/* Alert button to block a user.
   Button to block a profile.
   Context menu option for blocking users. */
"Block" = "Chặn";

/* Alert message prompt to ask if a user should be blocked. */
"Block %@?" = "Chặn %@?";

/* Title of alert for blocking a user. */
"Block User" = "Chặn người dùng";

/* Sidebar menu label for Profile view. */
"Blocked" = "Đã chặn";

/* Navigation title of view to see list of blocked users. */
"Blocked Users" = "Những người dùng đã chặn";

/* Dropdown option label for Lightning wallet, Blue Wallet. */
"Blue Wallet" = "Blue Wallet";

/* Sidebar menu label for Bookmarks view.
   Title of bookmarks view */
"Bookmarks" = "Đánh dấu trang";

/* Accessibility label for boosts button */
"Boosts" = "Boosts";

/* Dropdown option label for Lightning wallet, Breez. */
"Breez" = "Breez";

/* Button to broadcast note to all your relays
   Context menu option for broadcasting the user's note to all of the user's connected relay servers. */
"Broadcast" = "Phát tin";

/* Alert button to cancel out of alert for blocking a user.
   Button to cancel a repost.
   Button to cancel out of alert that creates a new mutelist.
   Button to cancel out of posting a note.
   Button to cancel out of reposting a post.
   Button to cancel out of view adding user inputted relay.
   Cancel deleting the user.
   Cancel out of logging out the user.
   Cancel out of search view. */
"Cancel" = "Hủy";

/* Dropdown option label for Lightning wallet, Cash App. */
"Cash App" = "Cash App";

/* Button for clearing bookmarks data. */
"Clear All" = "Xóa hết tất cả";

/* Button to clear image cache. */
"Clear Cache" = "Xóa cache";

/* Header text to indicate that the text field below it is a comment that will be used to send as part of a zap to the user. */
"Comment" = "Bình luận";

/* Label to display relay contact information. */
"Contact" = "Liên hệ";

/* Continue with deleting the user. */
"Continue" = "Tiếp tục";

/* Label indicating that a user's key was copied. */
"Copied" = "Đã sao chép";

/* Button to copy a relay server address. */
"Copy" = "Sao chép";

/* Context menu option for copying the ID of the account that created the note. */
"Copy Account ID" = "Sao chép ID Tài khoản";

/* Context menu option to copy an image into clipboard.
   Context menu option to copy an image to clipboard. */
"Copy Image" = "Sao chép hình ảnh";

/* Context menu option to copy the URL of an image into clipboard. */
"Copy Image URL" = "Sao chép URL hình ảnh";

/* Title of section for copying a Lightning invoice identifier. */
"Copy invoice" = "Sao chép invoice";

/* Button to copy link to note */
"Copy Link" = "Sao chép link";

/* Context menu option for copying a user's Lightning URL. */
"Copy LNURL" = "Sao chép LNURL";

/* Context menu option for copying the ID of the note. */
"Copy Note ID" = "Sao chép ID bài Note";

/* Context menu option for copying the JSON text from the note. */
"Copy Note JSON" = "Sao chép JSON bài Note";

/* Button to copy report ID. */
"Copy Report ID" = "Sao chép ID Báo cáo";

/* Context menu option for copying the text from an note. */
"Copy Text" = "Sao chép văn bản";

/* Context menu option for copying the ID of the user who created the note. */
"Copy User Pubkey" = "Sao chéo Pubkey của người dùng";

/* Alert message to indicate that the blocked user could not be found. */
"Could not find user to block..." = "Không thể tìm thấy người dùng để chặn";

/* Button to create account. */
"Create" = "Tạo";

/* Button to create an account. */
"Create Account" = "Tạo tài khoản";

/* Title of alert prompting the user to create a new mutelist. */
"Create new mutelist" = "Tạo danh sánh không hiển thị";

/* Example description about Bitcoin creator(s), Satoshi Nakamoto. */
"Creator(s) of Bitcoin. Absolute legend." = "Người tạo ra Bitcoin. Huyền thoại tuyệt đỉnh.";

/* Dropdown option for selecting a custom translation server. */
"Custom" = "Tự chọn";

/* Header text to indicate that the text field below it is to enter a custom zap amount. */
"Custom Zap Amount" = "Số lượng Zap tùy chọn";

/* Name of the app, shown on the first screen when user is not logged in. */
"Damus" = "Damus";

/* Dropdown option for selecting DeepL as the translation service. */
"DeepL (Proprietary, Higher Accuracy)" = "DeepL (Độc quyền, Độ chính xác cao hơn)";

/* Button to pay a Lightning invoice with the user's default Lightning wallet. */
"Default Wallet" = "Ví mặc định";

/* Section title for zap configuration */
"Default Zap Amount in sats" = "Số lượng Zap bằng sats mặc định";

/* Button for deleting the users account.
   Button to delete a relay server that the user connects to.
   Button to remove a user from their blocklist. */
"Delete" = "Xóa";

/* Button to delete the user's account. */
"Delete Account" = "Xóa tài khoản";

/* Alert message to indicate this is a deleted account */
"Deleted Account" = "Đã xóa tài khoản";

/* Label to display relay description. */
"Description" = "Miêu tả";

/* Button to disable image animation */
"Disable animations" = "Vô hiệu hóa hoạt ảnh";

/* Button to dismiss a text field alert. */
"Dismiss" = "Bỏ qua";

/* Label to prompt display name entry. */
"Display Name" = "Tên hiển thị";

/* Navigation title for DMs view, where DM is the English abbreviation for Direct Message.
   Navigation title for view of DMs, where DM is an English abbreviation for Direct Message.
   Picker option for DM selector for seeing only DMs that have been responded to. DM is the English abbreviation for Direct Message.
   Toolbar label for DMs view, where DM is the English abbreviation for Direct Message. */
"DMs" = "DM";

/* Button to dismiss wallet selection view for paying Lightning invoice. */
"Done" = "Hoàn tất";

/* Heading indicating that this application allows users to earn money. */
"Earn Money" = "Nhận tiền";

/* Button to edit user's profile. */
"Edit" = " Chỉnh sửa";

/* Text indicating that the view is used for editing which participants are replied to in a note. */
"Edit participants" = "Chỉnh sửa người tham gia";

/* Heading indicating that this application keeps private messaging end-to-end encrypted. */
"Encrypted" = "Được mã hóa";

/* Prompt for user to enter an account key to login. */
"Enter your account key to login:" = "Nhập khóa tài khoản của bạn để đăng nhập:";

/* Message to display when there was an error fetching a lightning invoice while attempting to zap. */
"Error fetching lightning invoice" = "Lỗi khi tìm lightning invoice";

/* Error message indicating why saving keys failed. */
"Error: %@" = "Lỗi: %@";

/* Label indicating that the below text is the EULA, an acronym for End User License Agreement. */
"EULA" = "Thỏa thuận cấp phép người dùng cuối (EULA)";

/* Description of public zap type where the zap is sent publicly and identifies the user who sent it. */
"Everyone on can see that you zapped" = "Mọi ngưởi đều có thể thấy bạn đã zap";

/* Button label text for filtering relay servers. */
"Filter" = "Lọc";

/* Button to follow a user. */
"Follow" = "Theo dõi";

/* Button to follow a user back. */
"Follow Back" = "Theo dõi lại";

/* Text on QR code view to prompt viewer looking at screen to follow the user. */
"Follow me on nostr" = "Theo dõi tôi trên nostr";

/* Label describing followers of a user.
   Navigation bar title for view that shows who is following a user. */
"Followers" = "Người theo dõi";

/* Navigation bar title for view that shows who a user is following. */
"Following" = "Đang theo dõi";

/* Label to indicate that the user is in the process of following another user. */
"Following..." = "Đang theo dõi...";

/* Text to indicate that a user is following your profile. */
"Follows you" = "Theo dõi bạn";

/* Dropdown option for selecting Free plan for DeepL translation service. */
"Free" = "Miễn phí";

/* Button to navigate to DeepL website to get a translation API key. */
"Get API Key" = "Nhận khóa API";

/* No comment provided by engineer. */
"Hello, World!" = "Xin chào, mọi người!";

/* Button to hide a post from a user who has been blocked. */
"Hide" = "Ẩn";

/* Button to hide the DeepL translation API key.
   Button to hide the LibreTranslate server API key. */
"Hide API Key" = "Ẩn khóa API";

/* Navigation bar title for Home view where posts and replies appear from those who the user is following. */
"Home" = "Trang chủ";

/* Placeholder example text for profile picture URL. */
"https://example.com/pic.jpg" = "https://example.com/pic.jpg";

/* Placeholder example text for website URL for user profile. */
"https://jb55.com" = "https://jb55.com";

/* Button for user to report that the account or content has illegal content. */
"Illegal content" = "Nội dung bất hợp pháp";

/* Section title for images configuration. */
"Images" = "Hình ảnh";

/* Error message indicating that an invalid account key was entered for login. */
"Invalid key" = "Khóa không hợp lệ";

/* Message to display when there was an error attempting to zap due to an invalid lightning address. */
"Invalid lightning address" = "Địa chỉ lightning không hợp lệ";

/* Title of alerting as invalid tip address. */
"Invalid Tip Address" = "Địa chỉ tiền Tip không hợp lệ";

/* Button for user to report that the account or content has spam. */
"It's spam" = "Spam";

/* Placeholder example text for identifier used for NIP-05 verification. */
"jb55@jb55.com" = "jb55@jb55.com";

/* Moves the post button to the left side of the screen */
"Left Handed" = "Thuận tay trái";

/* Button to complete account creation and start using the app. */
"Let's go!" = "Bắt đầu!";

/* Dropdown option for selecting LibreTranslate as the translation service. */
"LibreTranslate (Open Source)" = "LibreTranslate (Mã nguồn mở)";

/* Placeholder text for entry of Lightning Address or LNURL. */
"Lightning Address or LNURL" = "Địa chỉ Lightning hoặc LNURL";

/* Indicates that the view is for paying a Lightning invoice. */
"Lightning Invoice" = "Lightning Invoice";

/* Accessibility Label for Like button */
"Like" = "Thích";

/* Dropdown option label for Lightning wallet, LNLink. */
"LNLink" = "LNLink";

/* Button text for loading more events, where the variable is the number of events. */
"Load %@ more" = "Tải thêm %@";

/* Face ID usage description shown when trying to access private key */
"Local authentication to access private key" = "Xác thực cục bộ để truy cập khóa riêng";

/* Dropdown option label for system default for Lightning wallet. */
"Local default" = "Mặc định cục bộ";

/* Button to log into account.
   Button to log into an account.
   Title of view to log into an account. */
"Login" = "Đăng nhập";

/* Alert for logging out the user.
   Button for logging out the user.
   Button to close the alert that informs that the current account has been deleted. */
"Logout" = "Đăng xuất";

/* Label that appears when searching for note or profile */
"Looking for %@..." = "Đang tìm%@...";

/* Reminder message in alert to get customer to verify that their private security account key is saved saved before logging out. */
"Make sure your nsec account key is saved before you logout or you will lose access to this account" = "Đảm bảo khóa tài khoản nsec của bạn được lưu trước khi đăng xuất, nếu không bạn sẽ mất quyền truy cập vào tài khoản này";

/* Label for filter for seeing mention notifications (replies, etc). */
"Mentions" = "Đề cập";

/* Section header for miscellaneous user configuration */
"Miscellaneous" = "Linh tinh";

/* Dropdown option label for Lightning wallet, Muun. */
"Muun" = "Muun";

/* Label for NIP-05 Verification section of user profile form. */
"NIP-05 Verification" = "Xác minh NIP-05";

/* Button to cancel out of posting a note after being alerted that it looks like they might be posting a private key. */
"No" = "Không";

/* Alert message prompt that asks if the user wants to create a new block list, overwriting previous block lists. */
"No block list found, create a new one? This will overwrite any previous block lists." = "Không tìm thấy danh sách chặn, tạo một danh sách mới? Thao tác này sẽ ghi đè lên mọi danh sách chặn trước đó.";

/* No comment provided by engineer. */
"No data available" = "Không có dữ liệu khả dụng nào";

/* Description of anonymous zap type where the zap is sent anonymously and does not identify the user who sent it. */
"No one can see that you zapped" = "Không ai có thể thấy bạn đã zap";

/* Description of non-zap type where sats are sent to the user's wallet as a regular Lightning payment, not as a zap. */
"No zaps are sent, only a lightning payment." = "Không có zap nào được gửi, chỉ có thanh toán lightning";

/* No search results. */
"none" = "Không có";

/* Dropdown option for selecting no translation service. */
"none_translation_service" = "Không có";

/* Picker option to indicate that sats should be sent to the user's wallet as a regular Lightning payment, not as a zap. */
"none_zap_type" = "Không có";

/* Dropdown option label for system default for NostrBuild image uploader. */
"NostrBuild" = "NostrBuild";

/* Dropdown option label for system default for NostrImg image uploader. */
"NostrImg" = "NostrImg";

/* Alert user that they might be attempting to paste a private key and ask them to confirm. */
"Note contains \"nsec1\" private key. Are you sure?" = "Bài Note có chứa khóa riêng \"nsec1\". Bạn có chắc không?";

/* Indicates that there are no notes in the timeline to view. */
"Nothing to see here. Check back later!" = "Không có gì để xem. Quay lại sau!";

/* Toolbar label for Notifications view. */
"Notifications" = "Thông báo";

/* String indicating that a given timestamp just occurred */
"now" = "bây giờ";

/* Prompt for user to enter in an account key to login. This text shows the characters the key could start with if it was a private key. */
"nsec1..." = "nsec1...";

/* Button for user to report that the account or content has nudity or explicit content. */
"Nudity or explicit content" = "Nội dung khiêu dâm hoặc ảnh khỏa thân";

/* Button to dismiss the alert. */
"Ok" = "Ok";

/* Help text on green lock icon that explains that only the current user can see the message of a zap event and who sent the zap. */
"Only you can see this message and who sent it." = "Chỉ có bạn thấy được tin nhắn này và ai đã gửi nó.";

/* Label indicating that a form input is optional. */
"optional" = "tùy chọn";

/* Section header that indicates the relay server requires payment. */
"Paid Relay" = "Relay Trả Phí";

/* Button to pay a Lightning invoice. */
"Pay" = "Trả";

/* Navigation bar title for view to pay Lightning invoice. */
"Pay the Lightning invoice" = "Trả Lightning Invoice";

/* Alert for deleting the users account.
   Section title for deleting the user */
"Permanently Delete Account" = "Xóa tài khoản vĩnh viễn";

/* Dropdown option label for Lightning wallet, Phoenix. */
"Phoenix" = "Phoenix";

/* Prompt selection of DeepL subscription plan to perform machine translations on notes */
"Plan" = "Gói";

/* Instructions on how to filter a specific timeline feed by choosing relay servers to filter on. */
"Please choose relays from the list below to filter the current feed:" = "Vui lòng chọn relay từ danh sách bên dưới để lọc cho feed hiện tại:";

/* Button to post a note. */
"Post" = "Đăng";

/* Text to indicate that what is being shown is a post from a user who has been blocked. */
"Post from a user you've blocked" = "Bài đăng này đến từ người dùng mà bạn đã chặn";

/* Label for filter for seeing only posts (instead of posts and replies).
   Label for filter for seeing only your posts (instead of posts and replies). */
"Posts" = "Bài đăng";

/* Label for filter for seeing posts and replies (instead of only posts).
   Label for filter for seeing your posts and replies (instead of only your posts). */
"Posts & Replies" = "Bài đăng & Trả lời";

/* Heading indicating that this application keeps personally identifiable information private. A sentence describing what is done to keep data private comes after this heading.
   Picker option to indicate that a zap should be sent privately and not identify the user to the public. */
"Private" = "Riêng tư";

/* Label to indicate that the text below is the user's private key used by only the user themself as a secret to login to access their account.
   Title of the secure field that holds the user's private key. */
"Private Key" = "Khóa riêng tư";

/* Description of private zap type where the zap is sent privately and does not identify the user to the public. */
"private_zap_description" = "Chỉ có '%@' có thể thấy bạn đã zap họ.";

/* Dropdown option for selecting Pro plan for DeepL translation service. */
"Pro" = "Pro";

/* Sidebar menu label for Profile view. */
"Profile" = "Hồ sơ";

/* Label for Profile Picture section of user profile form. */
"Profile Picture" = "Hình ảnh hồ sơ";

/* Picker option to indicate that a zap should be sent publicly and identify the user as who sent it. */
"Public" = "Công khai";

/* Section title for the user's public account ID. */
"Public Account ID" = "ID Tài khoản công khai";

/* Label indicating that the text is a user's public account key.
   Label to indicate that text below is the user's public key used by others to uniquely refer to the user. */
"Public Key" = "Khóa công khai";

/* Label indicating that the text is a user's public account key. */
"Public key" = "Khóa công khai";

/* Prompt to ask user if the key they entered is a public key. */
"Public Key?" = "Khóa công khai?";

/* Navigation bar title for Reactions view. */
"Reactions" = "Thể hiện cảm xúc";

/* Section title for recommend relay servers that could be added as part of configuration */
"Recommended Relays" = "Relays được khuyến nghị";

/* Button to reject the end user license agreement, which disallows the user from being let into the app. */
"Reject" = "Từ chối";

/* Label to display relay address.
   Text field for relay server. Used for testing purposes. */
"Relay" = "Relay";

/* Header text for relay server list for configuration.
   Sidebar menu label for Relays view. */
"Relays" = "Relays";

/* Description of what was done as a result of sending a report to relay servers. */
"Relays have been notified and clients will be able to use this information to filter content. Thank you!" = "Relays đã được thông báo và clients sẽ có thể sử dụng thông tin này để lọc nội dung. Cảm ơn!";

/* Button label to remove all participants from a note reply. */
"Remove all" = "Bỏ tất cả";

/* Button text to remove bookmark from a note.
   Context menu option for removing a note bookmark. */
"Remove Bookmark" = "Xóa Dấu Trang";

/* Accessibility label for reply button */
"Reply" = "Trả lời";

/* Label to indicate that the user is replying to 1 user. */
"Replying to %@" = "Trả lời lại %@";

/* Label to indicate that the user is replying to 2 users. */
"Replying to %@ & %@" = "Trả lời lại %1$@ & %2$@";

/* Label to indicate that the user is replying to themself. */
"Replying to self" = "Trả lời lại chính bạn";

/* Indicating that the user is replying to the following listed people. */
"Replying to:" = "Trả lời lại:";

/* Button to report a profile.
   Context menu option for reporting content.
   Label indicating that the current view is for the user to report content. */
"Report" = "Báo cáo";

/* Label indicating that the text underneath is the identifier of the report that was sent to relay servers. */
"Report ID:" = "ID Báo cáo";

/* Message indicating that a report was successfully sent to relay servers. */
"Report sent!" = "Báo cáo đã gửi!";

/* Button to confirm reposting a post.
   Title of alert for confirming to repost a post. */
"Repost" = "Đăng lại";

/* Text indicating that the post was reposted (i.e. re-shared). */
"Reposted" = "Đã đăng lại";

/* Navigation bar title for Reposts view. */
"Reposts" = "Xem bài đăng lại";

/* Picker option for DM selector for seeing only message requests (DMs that someone else sent the user which has not been responded to yet). DM is the English abbreviation for Direct Message. */
"Requests" = "Yêu cầu";

/* Button to retry completing account creation after an error occurred. */
"Retry" = "Thử lại";

/* Dropdown option label for Lightning wallet, River */
"River" = "River";

/* Example username of Bitcoin creator(s), Satoshi Nakamoto. */
"satoshi" = "satoshi";

/* Name of Bitcoin creator(s). */
"Satoshi Nakamoto" = "Satoshi Nakamoto";

/* Button for saving profile. */
"Save" = "Lưu";

/* Context menu option to save an image. */
"Save Image" = "Lưu hình ảnh";

/* Text on QR code view to prompt viewer to scan the QR code on screen with their device camera. */
"Scan the code" = "Quét mã";

/* Navigation link to search hashtag. */
"Search hashtag: #%@" = "Tìm hashtag: #%@";

/* Placeholder text to prompt entry of search query. */
"Search..." = "Tìm...";

/* Section title for user's secret account login key. */
"Secret Account Login Key" = "Khóa đăng nhập tài khoản bí mật";

/* Title of section for selecting a Lightning wallet to pay a Lightning invoice. */
"Select a Lightning wallet" = "Chọn một ví Lightning";

/* Prompt selection of user's default wallet */
"Select default wallet" = "Chọn ví mặc định";

/* Prompt selection of user's image uploader */
"Select image uploader" = "Chọn trình tải lên hình ảnh";

/* Text prompt for user to send a message to the other user. */
"Send a message to start the conversation..." = "Gửi một tin nhắn để bắt đầu cuộc trò chuyện";

/* Prompt selection of LibreTranslate server to perform machine translations on notes */
"Server" = "Máy chủ";

/* Prompt selection of translation service provider. */
"Service" = "Dịch vụ";

/* Navigation title for Settings view.
   Sidebar menu label for accessing the app settings */
"Settings" = "Cài đặt";

/* Button to share a post
   Button to share an image.
   Button to share the link to a profile. */
"Share" = "Chia sẻ";

/* Title text to indicate that the buttons below are meant to be used to share a note with others. */
"Share Note" = "Chia sẻ bài Note";

/* Button to present iOS share sheet */
"Share Via..." = "Chia sẻ qua...";

/* Button to show a post from a user who has been blocked.
   Toggle to show or hide user's secret account login key. */
"Show" = "Hiển thị";

/* Button to show the DeepL translation API key.
   Button to show the LibreTranslate server API key. */
"Show API Key" = "Hiển thị khóa API";

/* Button to show entire note. */
"Show more" = "Hiển thị thêm";

/* Toggle to show or hide selection of wallet. */
"Show wallet selector" = "Hiển thị bộ chọn ví";

/* Section title for signing out */
"Sign Out" = "Đăng xuất";

/* Sidebar menu label to sign out of the account. */
"Sign out" = "Đăng xuất";

/* Label to display relay software. */
"Software" = "Phần mềm";

/* Dropdown option label for Lightning wallet, Strike. */
"Strike" = "Strike";

/* Label to display relay's supported NIPs. */
"Supported NIPs" = "NIPs được hỗ trợ";

/* Button to close out of alert that informs that the action to block a user was successful. */
"Thanks!" = "Cám ơn!";

/* Giving the description of the alert message. */
"The address should either begin with LNURL or should look like an email address." = "Địa chỉ phải bắt đầu bằng LNURL hoặc trông giống địa chỉ email.";

/* Button for user to report that the account is impersonating someone. */
"They are impersonating someone" = "Họ đang mạo danh ai đó";

/* Footer description that explains that the relay server requires payment to post. */
"This is a paid relay, you must pay for posts to be accepted." = "Đây là relay trả phí, bạn phải trả phí để bài đăng được chấp nhận.";

/* Warning that the inputted account key is a public key and the result of what happens because of it. */
"This is a public key, you will not be able to make posts or interact in any way. This is used for viewing accounts from their perspective." = "Đây là khóa công khai, bạn sẽ không thể tạo bài đăng hoặc tương tác dưới bất kỳ hình thức nào. Điều này được sử dụng để xem các tài khoản từ quan điểm của họ.";

/* Warning that the inputted account key for login is an old-style and asking user to verify if it is a public key. */
"This is an old-style nostr key. We're not sure if it's a pubkey or private key. Please toggle the button below if this a public key." = "Đây là một khóa nostr kiểu cũ. Chúng tôi không chắc đó là khóa công khai hay khóa cá nhân. Vui lòng chuyển đổi nút bên dưới nếu đây là khóa công khai.";

/* Label to describe that a public key is the user's account ID and what they can do with it. */
"This is your account ID, you can give this to your friends so that they can follow you. Tap to copy." = "Đây là ID tài khoản của bạn, bạn có thể cung cấp cho bạn bè của bạn để họ có thể theo dõi bạn. Nhấn để sao chép.";

/* Label to describe that a private key is the user's secret account key and what they should do with it. */
"This is your secret account key. You need this to access your account. Don't share this with anyone! Save it in a password manager and keep it safe!" = "Đây là khóa tài khoản bí mật của bạn. Bạn cần nó để truy cập vào tài khoản của bạn. Đừng chia sẻ điều này với bất cứ ai! Lưu nó trong trình quản lý mật khẩu và giữ an toàn!";

/* Navigation bar title for note thread. */
"Thread" = "Chủ đề";

/* Button to translate note from different language. */
"Translate Note" = "Dịch bài Note";

/* Button to indicate that the note has been translated from a different language. */
"Translated from %@" = "Được dịch từ %@";

/* Button to indicate that the note is in the process of being translated from a different language. */
"Translating from %@..." = "Đang dịch từ %@...";

/* Section title for selecting the translation service. */
"Translations" = "Dịch thuật";

/* Text field prompt asking user to type DELETE in all caps to confirm that they want to proceed with deleting their account. */
"Type %@ to delete" = "Nhập %@ để xóa";

/* Text box prompt to ask user to type their post. */
"Type your post here..." = "Nhập bài viết của bạn ở đây...";

/* Button to unfollow a user. */
"Unfollow" = "Hủy theo dõi";

/* Label to indicate that the user is in the process of unfollowing another user. */
"Unfollowing..." = "Bỏ theo dõi...";

/* Toolbar label for the universal view where posts from all connected relay servers appear. */
"Universe 🛸" = " Vũ Trụ 🛸";

/* Example URL to LibreTranslate server */
"URL" = "URL";

/* Alert message to indicate the user has been blocked */
"User blocked" = "Người dùng đã bị chặn";

/* Alert message that informs a user was blocked. */
"User has been blocked" = "Người dùng đã được chặn";

/* Label for Username section of user profile form.
   Label to prompt username entry. */
"Username" = "Username";

/* Label to display relay software version.
   Section title for displaying the version number of the Damus app. */
"Version" = "Phiên bản";

/* Sidebar menu label for Wallet view. */
"Wallet" = "Ví";

/* Dropdown option label for Lightning wallet, Wallet of Satoshi. */
"Wallet of Satoshi" = "Wallet of Satoshi";

/* Section title for selection of wallet. */
"Wallet Selector" = "Bộ chọn ví";

/* Alert for deleting the users account. */
"WARNING:\n\nTHIS WILL SIGN AN EVENT THAT DELETES THIS ACCOUNT.\n\nYOU WILL NO LONGER BE ABLE TO LOG INTO DAMUS USING THIS ACCOUNT KEY.\n\n ARE YOU SURE YOU WANT TO CONTINUE?" = "CHÚ Ý:\n\nĐIỀU NÀY SẼ ĐĂNG KÝ SỰ KIỆN XÓA TÀI KHOẢN NÀY.\n\nBẠN SẼ KHÔNG THỂ ĐĂNG NHẬP VÀO DAMUS BẰNG KHÓA TÀI KHOẢN NÀY.\n\nBẠN CÓ CHẮC CHẮN MUỐN TIẾP TỤC?";

/* Label for Website section of user profile form. */
"Website" = "Trang web";

/* Welcoming message to the reader. The variable is 'you', the reader. */
"Welcome to the social network %@ control." = "Chào mừng đến với mạng xã hội mà %@ kiểm soát.";

/* Text to welcome user. */
"Welcome, %@!" = "Chào mừng, %@!";

/* Header text to prompt user what issue they want to report. */
"What do you want to report?" = "Bạn muốn báo cáo gì?";

/* Placeholder example for relay server address. */
"wss://some.relay.com" = "wss://some.relay.com";

/* Text of button that confirms to overwrite the existing mutelist. */
"Yes, Overwrite" = "Ok, viết đè lên";

/* Button to proceed with posting a note even though it looks like they might be posting a private key. */
"Yes, Post with Private Key" = "Ok, đăng với Khóa riêng tư";

/* You, in this context, is the person who controls their own social network. You is used in the context of a larger sentence that welcomes the reader to the social network that they control themself. */
"you" = "bạn";

/* Text indicating that there are no bookmarks to be viewed */
"You have no bookmarks yet, add them in the context menu" = "Bạn chưa có dấu trang nào, hãy thêm chúng vào menu ngữ cảnh";

/* Label for Your Name section of user profile form. */
"Your Name" = "Tên của bạn";

/* Footer text to inform user what will happen when the report is submitted. */
"Your report will be sent to the relays you are connected to" = "Báo cáo của bạn sẽ được gửi đến relays mà bạn được kết nối";

/* Accessibility label for zap button
   Button to send a zap. */
"Zap" = "Zap";

/* Title of picker that allows selection of predefined amounts to zap. */
"Zap Amount" = "Số lượng Zap";

/* Header text to indicate that the picker below it is to choose a pre-defined amount of sats to zap. */
"Zap Amount in sats" = "Số lượng Zap bằng sats";

/* Header text to indicate that the picker below it is to choose the type of zap to send. */
"Zap Type" = "Thể loại Zap";

/* Setting to enable vibration on zap */
"Zap Vibration" = "Zap Rung";

/* Text to indicate that the app is in the process of sending a zap. */
"Zapping..." = "Đang zap...";

/* Label for filter for zap notifications.
   Navigation bar title for the Zaps view. */
"Zaps" = "Xem Zaps";

/* Dropdown option label for Lightning wallet, Zebedee. */
"Zebedee" = "Zebedee";

/* Dropdown option label for Lightning wallet, Zeus LN. */
"Zeus LN" = "Zeus LN";

/* Text indicating the zap amount. i.e. number of satoshis that were tipped to a user */
"⚡️ %@" = "⚡️ %@ ";

